# UpdaterRegistry Properties

---
The UpdaterRegistry type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
UpdaterRegistry Class
Autodesk.Revit.DB Namespace